app/controllers/api/v1/bookmarks_controller.rb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."name" = $1 AND "bookmarks"."user_id" = $2 LIMIT $3  [["name", "Naruto"], ["user_id", 1], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1  [["user_id", 1]]
SELECT "comics".* FROM "comics" WHERE "comics"."name" = $1 LIMIT $2  [["name", "One%20Piece"], ["LIMIT", 1]]
INSERT INTO "bookmarks" ("name", "comic_photo_url", "chapter", "page_number", "page_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
UPDATE "bookmarks" SET "page_number" = $1, "page_url" = $2, "updated_at" = $3 WHERE "bookmarks"."id" = $4  [["page_number", "50"], ["page_url", "http://localhost:3000/chapters/Naruto/1#page_50"], ["updated_at", "2021-12-20 07:07:47.841892"], ["id", 1]]
---
    def create
        if (bookmark = Bookmark.find_by(name: bookmark_params[:name], user_id: current_user))
            bookmark.chapter = bookmark_params[:chapter]
            bookmark.page_number = bookmark_params[:page_number]
            bookmark.page_url=bookmark_params[:page_url]
        elsif (10 <= Bookmark.where(user_id: current_user).length)
            Bookmark.destroy(Bookmark.where(user_id: current_user.id).order(:updated_at).first.id)
        else
            bookmark = Bookmark.new(bookmark_params)
            bookmark.comic_photo_url = Comic.find_by(name: bookmark_params[:name]).photo_url
            bookmark.user_id = current_user.id
        end

        if !bookmark.save