app/controllers/api/v1/chapters_controller.rb

    def index
      render json: Comic.find(name: params[:name])
---
SELECT "comics".* FROM "comics" WHERE "comics"."name" = $1 LIMIT $2  [["name", "Naruto"], ["LIMIT", 1]]