app/controllers/api/v1/chapters_controller.rb

    def show
      num_of_chapters = Comic.where(name: params[:id]).length
---
SELECT "comics".* FROM "comics" WHERE "comics"."name" = $1 LIMIT $2  [["name", "Naruto"], ["LIMIT", 1]]