app/controllers/api/v1/comics_controller.rb

    def index
      if(params["order"] == "alphabetic")
        render json: Comic.all.order(:name)
      elsif(params["order"] == "newest")
        render json: Comic.all.order(release_year: :desc)
      elsif(params["order"] == "oldest")
        render json: Comic.all.order(:release_year)
      elsif(params["order"] == "")
        render json: Comic.all
---
SELECT "comics".* FROM "comics" ORDER BY "comics"."name" ASC
SELECT "comics".* FROM "comics" ORDER BY "comics"."release_year" DESC
SELECT "comics".* FROM "comics" ORDER BY "comics"."release_year" ASC
SELECT "comics".* FROM "comics"

    def show
      if(params["source"] == "comic_show")
        render json: Comic.find_by(name: params[:name]), serializer: ComicShowSerializer
---
SELECT "comics".* FROM "comics" WHERE "comics"."name" = $1 LIMIT $2  [["name", "Jujutsu-Kaisen"], ["LIMIT", 1]]