app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      render json: User.find_by(id: current_user.id), serializer: UserShowSerializer